print('развитие событий')
ans = input('1) вариант1 2) вариант2')
if ans == '1':
    print('развитие событий')
    ans = input('1) вариант1 2) вариант2')
    if ans == '1':
        print('развитие событий')
        ans = input('1) вариант1 2) вариант2')
        if ans == '1':
            print('концовка1')
        else:
            print("концовка2")
    else:
        print('развитие событий')
        ans = input('1) вариант1 2) вариант2')
        if ans == '1':
            print('концовка3')
        else:
            print("концовка4")
else:
    print('развитие событий')
    ans = input('1) вариант1 2) вариант2')
    if ans == '1':
        print('развитие событий')
        ans = input('1) вариант1 2) вариант2')
        if ans == '1':
            print('концовка5')
        else:
            print("концовка6")
    else:
        print('развитие событий')
        ans = input('1) вариант1 2) вариант2')
        if ans == '1':
            print('концовка7')
        else:
            print("концовка8")

